#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_string.suffix: Refreshing state... [id=cgWwqCv4]
data.aws_availability_zones.available: Reading...
module.eks.module.eks_managed_node_group["two"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["two"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["one"].data.aws_partition.current: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/var.cluster_name-cgWwqCv4/cluster]
module.eks.module.eks_managed_node_group["two"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["one"].data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["one"].data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-018f6f1505bc0f4f6]
module.eks.data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["two"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["two"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["one"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["one"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.eks_managed_node_group["one"].aws_iam_role.this[0]: Refreshing state... [id=node-group-1-eks-node-group-20240816033008004900000003]
module.eks.module.eks_managed_node_group["two"].aws_iam_role.this[0]: Refreshing state... [id=node-group-2-eks-node-group-20240816033008002500000002]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=var.cluster_name-cgWwqCv4-cluster-20240816033007998600000001]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-045e4f59dd66bb072]
module.eks.module.eks_managed_node_group["two"].data.aws_caller_identity.current: Read complete after 0s [id=746196583728]
module.eks.module.eks_managed_node_group["one"].data.aws_caller_identity.current: Read complete after 0s [id=746196583728]
module.eks.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=746196583728]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=746196583728]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=node-group-2-eks-node-group-20240816033008002500000002-20240816033008750700000008]
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=node-group-1-eks-node-group-20240816033008004900000003-20240816033008749000000007]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=node-group-2-eks-node-group-20240816033008002500000002-20240816033008716200000006]
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=node-group-1-eks-node-group-20240816033008004900000003-20240816033008697300000004]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=node-group-2-eks-node-group-20240816033008002500000002-20240816033008708900000005]
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=node-group-1-eks-node-group-20240816033008004900000003-20240816033008772300000009]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=var.cluster_name-cgWwqCv4-cluster-20240816033007998600000001-2024081603300880080000000b]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=var.cluster_name-cgWwqCv4-cluster-20240816033007998600000001-2024081603300877510000000a]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=7b7e022b-01f2-4dbd-9951-14325eecbe96]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0c6ef2dad16643857]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03259f47a0ec13ebb]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-086eed2670add5e47]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-014ffe4e2a47c7bee]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-017624eac9cbccc33]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0787194cd818dadc4]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0ed08909d82a8919d]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0cadd80abaa820500]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0c9aaad1c10f523de]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-09efc1f34a62db4e7]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0ff62ae4e9fe8d436]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::746196583728:policy/var.cluster_name-cgWwqCv4-cluster-ClusterEncryption2024081603302565100000000e]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-021e1a9017badd7aa]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0a682f8afa1f8b730]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-014ffe4e2a47c7bee1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-017d886752b663289]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07488e8662096ff88]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0962ec7d076032c7c]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-02fca61e5ce314a3b]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-09231c21830ab4470]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1742998438]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-1381467468]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3102166738]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-3607907739]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-562345399]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3283855433]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2464544504]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3695607065]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-4051733524]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=var.cluster_name-cgWwqCv4-cluster-20240816033007998600000001-2024081603302588810000000f]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-09efc1f34a62db4e71080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] must be replaced
+/- resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:us-east-1:746196583728:log-group:/aws/eks/var.cluster_name-cgWwqCv4/cluster" -> (known after apply)
      ~ id                = "/aws/eks/var.cluster_name-cgWwqCv4/cluster" -> (known after apply)
      ~ name              = "/aws/eks/var.cluster_name-cgWwqCv4/cluster" -> "/aws/eks/test-cluster/cluster" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "test-cluster"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags_all                  = (known after apply)
      + version                   = "1.30"

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = "arn:aws:kms:us-east-1:746196583728:key/7b7e022b-01f2-4dbd-9951-14325eecbe96"
            }
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-017624eac9cbccc33",
              + "subnet-0c9aaad1c10f523de",
              + "subnet-0ed08909d82a8919d",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name" = "test-cluster-eks-irsa"
        }
      + tags_all        = {
          + "Name" = "test-cluster-eks-irsa"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] must be replaced
-/+ resource "aws_iam_policy" "cluster_encryption" {
      ~ arn         = "arn:aws:iam::746196583728:policy/var.cluster_name-cgWwqCv4-cluster-ClusterEncryption2024081603302565100000000e" -> (known after apply)
      ~ id          = "arn:aws:iam::746196583728:policy/var.cluster_name-cgWwqCv4-cluster-ClusterEncryption2024081603302565100000000e" -> (known after apply)
      ~ name        = "var.cluster_name-cgWwqCv4-cluster-ClusterEncryption2024081603302565100000000e" -> (known after apply)
      ~ name_prefix = "var.cluster_name-cgWwqCv4-cluster-ClusterEncryption" -> "test-cluster-cluster-ClusterEncryption" # forces replacement
      ~ policy_id   = "ANPA23PGIIUYG6FUOSHHG" -> (known after apply)
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_iam_role.this[0] must be replaced
+/- resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::746196583728:role/var.cluster_name-cgWwqCv4-cluster-20240816033007998600000001" -> (known after apply)
      ~ create_date           = "2024-08-16T03:30:08Z" -> (known after apply)
      ~ id                    = "var.cluster_name-cgWwqCv4-cluster-20240816033007998600000001" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::746196583728:policy/var.cluster_name-cgWwqCv4-cluster-ClusterEncryption2024081603302565100000000e",
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ] -> (known after apply)
      ~ name                  = "var.cluster_name-cgWwqCv4-cluster-20240816033007998600000001" -> (known after apply)
      ~ name_prefix           = "var.cluster_name-cgWwqCv4-cluster-" -> "test-cluster-cluster-" # forces replacement
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA23PGIIUYJ2PAKIFRC" -> (known after apply)
        # (5 unchanged attributes hidden)

      - inline_policy {
          - name   = "var.cluster_name-cgWwqCv4-cluster" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Deny"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      + inline_policy {
          + name   = "test-cluster-cluster"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:CreateLogGroup",
                            ]
                          + Effect   = "Deny"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      ~ id         = "var.cluster_name-cgWwqCv4-cluster-20240816033007998600000001-2024081603302588810000000f" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::746196583728:policy/var.cluster_name-cgWwqCv4-cluster-ClusterEncryption2024081603302565100000000e" # forces replacement -> (known after apply) # forces replacement
      ~ role       = "var.cluster_name-cgWwqCv4-cluster-20240816033007998600000001" # forces replacement -> (known after apply) # forces replacement
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] must be replaced
+/- resource "aws_iam_role_policy_attachment" "this" {
      ~ id         = "var.cluster_name-cgWwqCv4-cluster-20240816033007998600000001-2024081603300880080000000b" -> (known after apply)
      ~ role       = "var.cluster_name-cgWwqCv4-cluster-20240816033007998600000001" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] must be replaced
+/- resource "aws_iam_role_policy_attachment" "this" {
      ~ id         = "var.cluster_name-cgWwqCv4-cluster-20240816033007998600000001-2024081603300877510000000a" -> (known after apply)
      ~ role       = "var.cluster_name-cgWwqCv4-cluster-20240816033007998600000001" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_security_group.cluster[0] must be replaced
+/- resource "aws_security_group" "cluster" {
      ~ arn                    = "arn:aws:ec2:us-east-1:746196583728:security-group/sg-0787194cd818dadc4" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-0787194cd818dadc4" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Node groups to cluster API"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0ff62ae4e9fe8d436",
                ]
              - self             = false
              - to_port          = 443
            },
        ] -> (known after apply)
      ~ name                   = "var.cluster_name-cgWwqCv4-cluster-2024081603301956890000000d" -> (known after apply)
      ~ name_prefix            = "var.cluster_name-cgWwqCv4-cluster-" -> "test-cluster-cluster-" # forces replacement
      ~ owner_id               = "746196583728" -> (known after apply)
      ~ tags                   = {
          ~ "Name" = "var.cluster_name-cgWwqCv4-cluster" -> "test-cluster-cluster"
        }
      ~ tags_all               = {
          ~ "Name" = "var.cluster_name-cgWwqCv4-cluster" -> "test-cluster-cluster"
        }
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_security_group.node[0] must be replaced
+/- resource "aws_security_group" "node" {
      ~ arn                    = "arn:aws:ec2:us-east-1:746196583728:security-group/sg-0ff62ae4e9fe8d436" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all egress"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-0ff62ae4e9fe8d436" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node 8443/tcp webhook"
              - from_port        = 8443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0787194cd818dadc4",
                ]
              - self             = false
              - to_port          = 8443
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node 9443/tcp webhook"
              - from_port        = 9443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0787194cd818dadc4",
                ]
              - self             = false
              - to_port          = 9443
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node groups"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0787194cd818dadc4",
                ]
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node kubelets"
              - from_port        = 10250
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0787194cd818dadc4",
                ]
              - self             = false
              - to_port          = 10250
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node CoreDNS UDP"
              - from_port        = 53
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "udp"
              - security_groups  = []
              - self             = true
              - to_port          = 53
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node CoreDNS"
              - from_port        = 53
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 53
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node ingress on ephemeral ports"
              - from_port        = 1025
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 65535
            },
        ] -> (known after apply)
      ~ name                   = "var.cluster_name-cgWwqCv4-node-2024081603301956640000000c" -> (known after apply)
      ~ name_prefix            = "var.cluster_name-cgWwqCv4-node-" -> "test-cluster-node-" # forces replacement
      ~ owner_id               = "746196583728" -> (known after apply)
      ~ tags                   = {
          ~ "Name"                                            = "var.cluster_name-cgWwqCv4-node" -> "test-cluster-node"
          + "kubernetes.io/cluster/test-cluster"              = "owned"
          - "kubernetes.io/cluster/var.cluster_name-cgWwqCv4" = "owned" -> null
        }
      ~ tags_all               = {
          ~ "Name"                                            = "var.cluster_name-cgWwqCv4-node" -> "test-cluster-node"
          + "kubernetes.io/cluster/test-cluster"              = "owned"
          - "kubernetes.io/cluster/var.cluster_name-cgWwqCv4" = "owned" -> null
        }
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] must be replaced
+/- resource "aws_security_group_rule" "cluster" {
      ~ id                       = "sgrule-4051733524" -> (known after apply)
      ~ security_group_id        = "sg-0787194cd818dadc4" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0151f8595b6e75917" -> (known after apply)
      ~ source_security_group_id = "sg-0ff62ae4e9fe8d436" # forces replacement -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["egress_all"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-1381467468" -> (known after apply)
      ~ security_group_id        = "sg-0ff62ae4e9fe8d436" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0ac898b7c8ddd560c" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-2464544504" -> (known after apply)
      ~ security_group_id        = "sg-0ff62ae4e9fe8d436" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0fa3903c1be99f965" -> (known after apply)
      ~ source_security_group_id = "sg-0787194cd818dadc4" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-3695607065" -> (known after apply)
      ~ security_group_id        = "sg-0ff62ae4e9fe8d436" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0b529af40bccd1237" -> (known after apply)
      ~ source_security_group_id = "sg-0787194cd818dadc4" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-3102166738" -> (known after apply)
      ~ security_group_id        = "sg-0ff62ae4e9fe8d436" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-03e2bb42fe15797d5" -> (known after apply)
      ~ source_security_group_id = "sg-0787194cd818dadc4" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-3607907739" -> (known after apply)
      ~ security_group_id        = "sg-0ff62ae4e9fe8d436" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0303c6191cadc5105" -> (known after apply)
      ~ source_security_group_id = "sg-0787194cd818dadc4" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-562345399" -> (known after apply)
      ~ security_group_id        = "sg-0ff62ae4e9fe8d436" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0a6ea09597aa77b7c" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-3283855433" -> (known after apply)
      ~ security_group_id        = "sg-0ff62ae4e9fe8d436" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-02088cb08768c9b17" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-1742998438" -> (known after apply)
      ~ security_group_id        = "sg-0ff62ae4e9fe8d436" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-052bb4fb4f8a2fd35" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0c9aaad1c10f523de"
      ~ tags                                           = {
            "Name"                                            = "education-vpc-private-us-east-1a"
          + "kubernetes.io/cluster/gitops-cgWwqCv4"           = "shared"
          - "kubernetes.io/cluster/var.cluster_name-cgWwqCv4" = "shared" -> null
            "kubernetes.io/role/internal-elb"                 = "1"
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/gitops-cgWwqCv4"           = "shared"
          - "kubernetes.io/cluster/var.cluster_name-cgWwqCv4" = "shared" -> null
            # (2 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0ed08909d82a8919d"
      ~ tags                                           = {
            "Name"                                            = "education-vpc-private-us-east-1b"
          + "kubernetes.io/cluster/gitops-cgWwqCv4"           = "shared"
          - "kubernetes.io/cluster/var.cluster_name-cgWwqCv4" = "shared" -> null
            "kubernetes.io/role/internal-elb"                 = "1"
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/gitops-cgWwqCv4"           = "shared"
          - "kubernetes.io/cluster/var.cluster_name-cgWwqCv4" = "shared" -> null
            # (2 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-017624eac9cbccc33"
      ~ tags                                           = {
            "Name"                                            = "education-vpc-private-us-east-1c"
          + "kubernetes.io/cluster/gitops-cgWwqCv4"           = "shared"
          - "kubernetes.io/cluster/var.cluster_name-cgWwqCv4" = "shared" -> null
            "kubernetes.io/role/internal-elb"                 = "1"
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/gitops-cgWwqCv4"           = "shared"
          - "kubernetes.io/cluster/var.cluster_name-cgWwqCv4" = "shared" -> null
            # (2 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-086eed2670add5e47"
      ~ tags                                           = {
            "Name"                                            = "education-vpc-public-us-east-1a"
          + "kubernetes.io/cluster/gitops-cgWwqCv4"           = "shared"
          - "kubernetes.io/cluster/var.cluster_name-cgWwqCv4" = "shared" -> null
            "kubernetes.io/role/elb"                          = "1"
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/gitops-cgWwqCv4"           = "shared"
          - "kubernetes.io/cluster/var.cluster_name-cgWwqCv4" = "shared" -> null
            # (2 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-03259f47a0ec13ebb"
      ~ tags                                           = {
            "Name"                                            = "education-vpc-public-us-east-1b"
          + "kubernetes.io/cluster/gitops-cgWwqCv4"           = "shared"
          - "kubernetes.io/cluster/var.cluster_name-cgWwqCv4" = "shared" -> null
            "kubernetes.io/role/elb"                          = "1"
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/gitops-cgWwqCv4"           = "shared"
          - "kubernetes.io/cluster/var.cluster_name-cgWwqCv4" = "shared" -> null
            # (2 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0c6ef2dad16643857"
      ~ tags                                           = {
            "Name"                                            = "education-vpc-public-us-east-1c"
          + "kubernetes.io/cluster/gitops-cgWwqCv4"           = "shared"
          - "kubernetes.io/cluster/var.cluster_name-cgWwqCv4" = "shared" -> null
            "kubernetes.io/role/elb"                          = "1"
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/gitops-cgWwqCv4"           = "shared"
          - "kubernetes.io/cluster/var.cluster_name-cgWwqCv4" = "shared" -> null
            # (2 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)
    }

  # module.eks.module.eks_managed_node_group["one"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "test-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "node-group-1-"
      + node_role_arn          = "arn:aws:iam::746196583728:role/node-group-1-eks-node-group-20240816033008004900000003"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-017624eac9cbccc33",
          + "subnet-0c9aaad1c10f523de",
          + "subnet-0ed08909d82a8919d",
        ]
      + tags                   = {
          + "Name" = "node-group-1"
        }
      + tags_all               = {
          + "Name" = "node-group-1"
        }
      + version                = "1.30"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks.module.eks_managed_node_group["one"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for node-group-1 EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "one-"
      + tags_all               = (known after apply)
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)
        # (2 unchanged attributes hidden)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "node-group-1"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name" = "node-group-1"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name" = "node-group-1"
            }
        }
    }

  # module.eks.module.eks_managed_node_group["two"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "test-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "node-group-2-"
      + node_role_arn          = "arn:aws:iam::746196583728:role/node-group-2-eks-node-group-20240816033008002500000002"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-017624eac9cbccc33",
          + "subnet-0c9aaad1c10f523de",
          + "subnet-0ed08909d82a8919d",
        ]
      + tags                   = {
          + "Name" = "node-group-2"
        }
      + tags_all               = {
          + "Name" = "node-group-2"
        }
      + version                = "1.30"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks.module.eks_managed_node_group["two"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for node-group-2 EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "two-"
      + tags_all               = (known after apply)
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)
        # (2 unchanged attributes hidden)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "node-group-2"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name" = "node-group-2"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name" = "node-group-2"
            }
        }
    }

  # module.eks.module.kms.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + override_policy_documents = []
      + source_policy_documents   = []

      + statement {
          + actions   = [
              + "kms:CancelKeyDeletion",
              + "kms:Create*",
              + "kms:Delete*",
              + "kms:Describe*",
              + "kms:Disable*",
              + "kms:Enable*",
              + "kms:Get*",
              + "kms:List*",
              + "kms:Put*",
              + "kms:Revoke*",
              + "kms:ScheduleKeyDeletion",
              + "kms:TagResource",
              + "kms:UntagResource",
              + "kms:Update*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyAdministration"

          + principals {
              + identifiers = [
                  + "arn:aws:sts::746196583728:assumed-role/test-role/test-role",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyUsage"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.eks.module.kms.aws_kms_alias.this["cluster"] will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/eks/test-cluster"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = "7b7e022b-01f2-4dbd-9951-14325eecbe96"
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
      ~ description                        = "var.cluster_name-cgWwqCv4 cluster encryption key" -> "test-cluster cluster encryption key"
        id                                 = "7b7e022b-01f2-4dbd-9951-14325eecbe96"
      ~ policy                             = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "kms:Update*",
                          - "kms:UntagResource",
                          - "kms:TagResource",
                          - "kms:ScheduleKeyDeletion",
                          - "kms:Revoke*",
                          - "kms:Put*",
                          - "kms:List*",
                          - "kms:Get*",
                          - "kms:Enable*",
                          - "kms:Disable*",
                          - "kms:Describe*",
                          - "kms:Delete*",
                          - "kms:Create*",
                          - "kms:CancelKeyDeletion",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:sts::746196583728:assumed-role/test-role/test-role"
                        }
                      - Resource  = "*"
                      - Sid       = "KeyAdministration"
                    },
                  - {
                      - Action    = [
                          - "kms:ReEncrypt*",
                          - "kms:GenerateDataKey*",
                          - "kms:Encrypt",
                          - "kms:DescribeKey",
                          - "kms:Decrypt",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::746196583728:role/var.cluster_name-cgWwqCv4-cluster-20240816033007998600000001"
                        }
                      - Resource  = "*"
                      - Sid       = "KeyUsage"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags                               = {}
        # (10 unchanged attributes hidden)
    }

Plan: 24 to add, 7 to change, 17 to destroy.

Changes to Outputs:
  + cluster_endpoint          = (known after apply)
  + cluster_name              = "test-cluster"
  ~ cluster_security_group_id = "sg-0787194cd818dadc4" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @insiible-techup, Action: `pull_request`, Working Directory: `./terraform`, Workflow: `Terraform plan`*